CSI API ETABS v1
cPropTendon.Count Method
 Retrieves the total number of defined tendon properties in the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Count()
Function Count As Integer
Dim instance As cPropTendon
Dim returnValue As Integer
returnValue = instance.Count()
int Count()
abstract Count : unit -> int
Return Value
Type: Int32
Returns the total number of defined tendon properties in the model.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim Count As Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add tendon material
       ret = SapModel.PropMaterial.AddQuick(Name, eMatType.Tendon, , , , , , eMatTypeTendon.ASTM_A416Gr270)
   'set new tendon property
       ret = SapModel.PropTendon.SetProp("T1", Name, 1, 2.25)
   'return number of defined tendon properties
       Count = SapModel.PropTendon.Count
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropTendon Interface
ETABSv1 Namespace